In [1]:
import sqlite3 as sql

In [2]:
conn=sql.connect(" memory ")

In [3]:
cur=conn.cursor()

In [4]:
# this is work only on crud operation

In [7]:
q='''create table mb(mid int (20),m_name varchar (20),price_float)'''

cur.execute(q)
print("Arjun")

Arjun

In [9]:
q='''insert into mb values (1,"vivo",45890),(2,"samsung",845697),(3,"Apple",125784)'''

cur.execute(q)
print("done")

done

In [16]:
q='''select * from mb'''
cur.execute(q)
result=cur.fetchall()
import pandas as pd
pd.DataFrame(result,columns= [i[0] for i in cur.description])

   mid   m_name  price_float
0    1     vivo        45890
1    2  samsung       845697
2    3    Apple       125784
3    1     vivo        45890
4    2  samsung       845697
5    3    Apple       125784

In [11]:
result

[(1, 'vivo', 45890),
 (2, 'samsung', 845697),
 (3, 'Apple', 125784),
 (1, 'vivo', 45890),
 (2, 'samsung', 845697),
 (3, 'Apple', 125784)]